[
    {
        "id": "6357d69b66fc764a77d03262",
        "img_url": "https://fullscale.io/wp-content/uploads/2022/04/what-is-a-react-developer.png",
        "title": "React Developer",
        "info": "This course is fully up-to-date with React 18 (the latest version of React)!\r\n\r\nIt was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know!\r\n\r\n---\r\n\r\nThis course also comes with two paths which you can take: The \"complete\" path (full >40h course) and the \"summary\" path (~4h summary module) - you can choose the path that best fits your time requirements! :-)\r\n\r\n---\r\n\r\nReact.js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web.\r\n\r\nThis course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well.\r\n\r\nYou'll get all the theory, tons of examples and demos, assignments and exercises and tons of important knowledge that is skipped by most other resources - after all, there is a reason why this course is that huge! :)\r\n\r\nAnd in case you don't even know why you would want to learn React and you're just here because of some ad or \"the algorithm\" - no worries: ReactJS is a key technology as a web developer and in this course I will also explain WHY it's that important!\r\n\r\n\r\n\r\nWelcome to \"React - The Complete Guide\"!\r\n\r\nThis course will teach you React.js in a practice-oriented way, using all the latest patterns and best practices you need. You will learn all the key fundamentals as well as advanced concepts and related topics to turn you into a React.js developer.\r\n\r\nThis is a huge course because it really covers EVERYTHING you need to know and learn to become a React.js developer!\r\n\r\nNo matter if you know nothing about React or if you already got some basic React knowledge (not required but also not a problem), you will get tons of useful information and knowledge out of this course!\r\n\r\nMy goal with this course is to ensure that you feel confident working with React, so that you can apply for React jobs, use it in your own projects or simply enhance your portfolio as a developer - whatever your goal is: This course gets you there!\r\n\r\n\r\n\r\nI originally created this course in 2017 and I have kept it updated since that - redoing it from the ground up in 2021. And of course I'm dedicated to keeping this course up-to-date - so that you can rely on this course to learn React in the best possible way!\r\n\r\nWhat's in this course?\r\n\r\nA thorough introduction to React.js (What is it and why would you use it?)\r\n\r\nAll the core basics: How React works, building components with React & building UIs with React\r\n\r\nComponents, props & dynamic data binding\r\n\r\nWorking with user events and state to create interactive applications\r\n\r\nA (thorough) look behind the scenes to understand how React works under the hood\r\n\r\nDetailed explanations on how to work with lists and conditional content\r\n\r\nReact Hooks (in-depth)!\r\n\r\nWorking with built-in Hooks and building custom Hooks\r\n\r\nHow to debug React apps\r\n\r\nStyling React apps with \"Styled Components\" and \"CSS Modules\"\r\n\r\nWorking with \"Fragments\" & \"Portals\"\r\n\r\nDealing with side effects\r\n\r\nClass-based components and functional components\r\n\r\nSending Http requests & handling transitional states + responses\r\n\r\nHandling forms and user input (incl. validation)\r\n\r\nRedux & Redux Toolkit\r\n\r\nRouting with React Router\r\n\r\nAn in-depth introduction into Next.js\r\n\r\nDeploying React Apps\r\n\r\nImplementing Authentication\r\n\r\nUnit Tests\r\n\r\nCombining React with TypeScript\r\n\r\nAdding Animations\r\n\r\nTons of examples and demo projects so that you can apply all the things you learned in real projects\r\n\r\nAnd so much more - check out the full curriculum on this page!\r\n\r\nThis really is the \"Complete Guide\" - promised!\r\n\r\nAnd best of all?\r\n\r\nYou don't need any prior React knowledge!\r\n\r\nThis course starts with zero knowledge assumed! All you need is basic web development and JavaScript knowledge (though the course even includes a brief JavaScript refresher to ensure that we're all on the same page!).\r\n\r\nCheck out the full curriculum, the free preview videos and join the course risk-free thanks to the 30-day money-back guarantee!"
    },
    {
        "id": "6357d69bc36782201dfcecec",
        "img_url": "https://blog.sagipl.com/wp-content/uploads/2017/04/best-javascript-frameworks-1.jpg",
        "title": "Learn Javascript",
        "info": "Updated for 2022! This course is unlike any JavaScript course you will find online. Join a live online community of over 600,000+ developers and a course taught by an industry expert that has actually worked both in Silicon Valley and Toronto as a senior developer. Graduates of this course are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook + other top tech companies.\r\n\r\nAfter many years of working with the language, Andrei has taken decades of experience, combining best practices from some of the top developers in the world, to get you to become one of the top performing Javascript developers. You will go from understanding the basics of JavaScript, to learning it to the point that you can teach it to others, impress coworkers, and wow future employers. You will be in the top 10% of JavaScript Programmers by the end of this course.\r\n\r\nThis course is the accumulation of years in the field, and combining the best resources, tools, and tutorials out there to create the ultimate JavaScript course that will teach you everything you need to know to be considered a Senior Javascript Developer.\r\n\r\nInstead of spending years learning advanced Javascript concepts, you can fast track and get the knowledge that senior javascript developers have in just 30 days.\r\n\r\nWith this course you are going to learn beyond just the basics like most online courses. You won't just learn patterns, techniques and best practices. You are going to understand the \"why\" of the toughest part of the language, to the point that when you get asked any question about Javascript in an interview or in a meeting, you will be able to explain concepts that would truly make people see that you are a senior javascript programmer.\r\n\r\nMost importantly, you will become a top 10% javascript developer by going beyond the superficial basics that a lot of courses cover. We are going to dive deep and come out the other end a confident advanced javascript developer. I guarantee it. Whether you are a web developer, a React, Angular, Vue.js developer (frontend developer), or a Node.js backend developer, you will benefit from this course because Javascript is at the core of these professions.\r\n\r\nSome of the topics covered in this course are:\r\n\r\nJavascript Engine\r\n\r\nJavascript Runtime\r\n\r\nInterpreter, Compiler, JIT Compiler\r\n\r\nWriting Optimized Code\r\n\r\nCall Stack + Memory Heap\r\n\r\nStack Overflow + Memory Leaks\r\n\r\nGarbage Collection\r\n\r\nNode.js\r\n\r\nES6, ES7, ES8, ES9, ES10, ES2020, ES2021 features\r\n\r\nSingle Threaded Model\r\n\r\nExecution Context\r\n\r\nLexical Environment\r\n\r\nScope Chain\r\n\r\nHoisting\r\n\r\nFunction Invocation\r\n\r\nFunction Scope vs Block Scope\r\n\r\nDynamic vs Lexical Scope\r\n\r\nthis - call(), apply(), bind()\r\n\r\nIIFEs\r\n\r\nContext vs Scope\r\n\r\nStatic vs Dynamically Typed\r\n\r\nPrimitive Types\r\n\r\nPass by Reference vs Pass by Value\r\n\r\nType Coercion\r\n\r\nArrays, Functions, Objects\r\n\r\nClosures\r\n\r\nPrototypal Inheritance\r\n\r\nClass Inheritance\r\n\r\nMemoization\r\n\r\nHigher Order Functions\r\n\r\nFunctions vs Objects\r\n\r\nScheme + Java in JavaScript\r\n\r\nOOP (Object Oriented Programming)\r\n\r\nPrivate vs Public properties\r\n\r\nFunctional Programming\r\n\r\nImmutability\r\n\r\nImperative vs Declarative code\r\n\r\nComposition vs Inheritance\r\n\r\nCurrying\r\n\r\nPartial Application\r\n\r\nPure Functions\r\n\r\nReferential Transparency\r\n\r\nCompose\r\n\r\nPipe\r\n\r\nError Handling\r\n\r\nAsynchronous JavaScript\r\n\r\nCallbacks, Promises, Async/Await\r\n\r\nEvent Loop + Callback Queue\r\n\r\nTask Queue + Microtask Queue\r\n\r\nConcurrency + Parallelism\r\n\r\nModules in Javascript\r\n\r\n\r\nThe topics you will learn in this course are timeless and will allow you to stay current with any new library or framework that comes out in the javascript ecosystem since you will have the core concepts understood.\r\n\r\nI guarantee you that you will not find a course as detailed and as well explained as this one at the end of the course I guarantee you that you will be in the top 10% of JavaScript developers or your money back! And remember,\r\n\r\nBy joining this course you will also get access to one of the largest online communities and classroom for full stack developers.\r\n\r\nSee you inside the course!\r\n\r\n---------------------------\r\n\r\nTaught by:\r\nAndrei is the instructor of the highest rated Web Development courses on Udemy as well as one of the fastest growing. His graduates have moved on to work for some of the biggest tech companies around the world like Apple, Google, JP Morgan, IBM, etc... He has been working as a senior software developer in Silicon Valley and Toronto for many years, and is now taking all that he has learned, to teach programming skills and to help you discover the amazing career opportunities that being a developer allows in life. \r\n\r\nHaving been a self taught programmer, he understands that there is an overwhelming number of online courses, tutorials and books that are overly verbose and inadequate at teaching proper skills. Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp. Programming skills should be affordable and open to all. An education material should teach real life skills that are current and they should not waste a student's valuable time.   Having learned important lessons from working for Fortune 500 companies, tech startups, to even founding his own business, he is now dedicating 100% of his time to teaching others valuable software development skills in order to take control of their life and work in an exciting industry with infinite possibilities. \r\n\r\nAndrei promises you that there are no other courses out there as comprehensive and as well explained. He believes that in order to learn anything of value, you need to start with the foundation and develop the roots of the tree. Only from there will you be able to learn concepts and specific skills(leaves) that connect to the foundation. Learning becomes exponential when structured in this way. \r\n\r\nTaking his experience in educational psychology and coding, Andrei's courses will take you on an understanding of complex subjects that you never thought would be possible.  \r\n\r\n\r\n\r\nWho this course is for:\r\nDevelopers who want to be considered in the top 10% of JavaScript programmers\r\nBootcamp or online tutorial graduates that want to go beyond the basics\r\nJunior JavaScript Developers\r\nJunior Web Developers\r\nProgrammers who don't want to waste time on basics and want to dive deep",
        "time": 362
    },
    {
        "id": "6357d69be3b916ad8a2a303d",
        "img_url": "https://imageio.forbes.com/specials-images/dam/imageserve/966248982/960x0.jpg?format=jpg&width=960",
        "title": "Machine Learning A-Z",
        "info": "Interested in the field of Machine Learning? Then this course is for you!\r\n\r\nThis course has been designed by two professional Data Scientists so that we can share our knowledge and help you learn complex theory, algorithms, and coding libraries in a simple way.\r\n\r\nWe will walk you step-by-step into the World of Machine Learning. With every tutorial, you will develop new skills and improve your understanding of this challenging yet lucrative sub-field of Data Science.\r\n\r\nThis course is fun and exciting, but at the same time, we dive deep into Machine Learning. It is structured the following way:\r\n\r\nPart 1 - Data Preprocessing\r\n\r\nPart 2 - Regression: Simple Linear Regression, Multiple Linear Regression, Polynomial Regression, SVR, Decision Tree Regression, Random Forest Regression\r\n\r\nPart 3 - Classification: Logistic Regression, K-NN, SVM, Kernel SVM, Naive Bayes, Decision Tree Classification, Random Forest Classification\r\n\r\nPart 4 - Clustering: K-Means, Hierarchical Clustering\r\n\r\nPart 5 - Association Rule Learning: Apriori, Eclat\r\n\r\nPart 6 - Reinforcement Learning: Upper Confidence Bound, Thompson Sampling\r\n\r\nPart 7 - Natural Language Processing: Bag-of-words model and algorithms for NLP\r\n\r\nPart 8 - Deep Learning: Artificial Neural Networks, Convolutional Neural Networks\r\n\r\nPart 9 - Dimensionality Reduction: PCA, LDA, Kernel PCA\r\n\r\nPart 10 - Model Selection & Boosting: k-fold Cross Validation, Parameter Tuning, Grid Search, XGBoost\r\n\r\nMoreover, the course is packed with practical exercises that are based on real-life examples. So not only will you learn the theory, but you will also get some hands-on practice building your own models.\r\n\r\nAnd as a bonus, this course includes both Python and R code templates which you can download and use on your own projects.\r\n\r\nImportant updates (June 2020):\r\n\r\nCODES ALL UP TO DATE\r\n\r\nDEEP LEARNING CODED IN TENSORFLOW 2.0\r\n\r\nTOP GRADIENT BOOSTING MODELS INCLUDING XGBOOST AND EVEN CATBOOST!\r\n\r\n\r\n\r\nWho this course is for:\r\nAnyone interested in Machine Learning.\r\nStudents who have at least high school knowledge in math and who want to start learning Machine Learning.\r\nAny intermediate level people who know the basics of machine learning, including the classical algorithms like linear regression or logistic regression, but who want to learn more about it and explore all the different fields of Machine Learning.\r\nAny people who are not that comfortable with coding but who are interested in Machine Learning and want to apply it easily on datasets.\r\nAny students in college who want to start a career in Data Science.\r\nAny data analysts who want to level up in Machine Learning.\r\nAny people who are not satisfied with their job and who want to become a Data Scientist.\r\nAny people who want to create added value to their business by using powerful Machine Learning tools.",
        "time": 282
    },
    {
        "id": "6357d69b30f10de6d7e87d30",
        "img_url": "https://www.mindinventory.com/blog/wp-content/uploads/2021/11/mobile-ux-design-best-practices.png",
        "title": "UI/UX Design",
        "info": "Just updated with all modern Design tools and best practices for 2022! Join a live online community of over 600,000+ students and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto for top companies. A great Designer is becoming harder and harder to find and it isn't rare to find designers make $160,000+ salaries now because it is such a valuable skill. We will teach you how to get there!\r\n\r\nUsing the latest best practices in Web Design and Mobile Design as well as User Interface and User Experience Design (UI/UX), this course focuses on efficiently getting you from zero to a point where you can get hired or win freelance contracts. We will use in demand tools like Figma to show you a full workflow from start to finish. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies.\r\n\r\n\r\n\r\nThe course also includes 100+ assets and premium design templates that you can keep and use to customize for all your future projects. We guarantee you this is the most comprehensive online resource on Design skills!\r\n\r\n\r\n\r\nThe curriculum is going to be very hands on as we walk you from start to finish of working as a Designer, all the way into learning how to create final professional designs and then converting them into actual websites or apps using HTML and CSS. \r\n\r\nThe topics covered in the course are...\r\n\r\n\r\n\r\n00 Web & Mobile Design Principles +  Design vs Web Development\r\n\r\n\r\n\r\n01 GETTING STARTED – Sketching, Inspiration + Structure\r\n\r\n1. Sketching\r\n\r\nIntroduction To Sketching\r\n\r\nThe Sketching Process\r\n\r\nSketching User Flows\r\n\r\nSketching Tips\r\n\r\n2. Inspiration\r\n\r\nHow to stay inspired\r\n\r\nHow to find inspiration online\r\n\r\n3. Figma Basics\r\n\r\nPlans and Signup\r\n\r\nWhere to Use Figma\r\n\r\nFigma UI — Structure\r\n\r\nFigma UI — Files\r\n\r\nFigma UI — Toolbar\r\n\r\nFigma UI — Left Sidebar\r\n\r\nFigma UI — Right Sidebar\r\n\r\nShapes and Tools — Frames\r\n\r\nShapes and Tools — Groups\r\n\r\nShapes and Tools — Basic Shapes and Boolean Operations\r\n\r\nDesigning in Figma — Images\r\n\r\nDesigning in Figma — Getting Started with Text\r\n\r\nDesigning in Figma — Constraints\r\n\r\nDesigning in Figma — Using Auto Layout\r\n\r\nDesigning in Figma — Auto Layout Properties\r\n\r\nResources and Collaboration — Community Files\r\n\r\nResources and Collaboration — Community Plugins\r\n\r\nResources and Collaboration — Sharing and Comments]\r\n\r\nProject — Creating a Logo Using Basic Shapes\r\n\r\nProject — Auto Layout Buttons\r\n\r\nProject — Creating a Responsive Navigation\r\n\r\nProject — Responsive Text\r\n\r\nProject — Imagery and Gradients\r\n\r\nProject — Strokes and Shapes\r\n\r\nProject — Layout and Responsiveness\r\n\r\n3. User Flows\r\n\r\nGetting Ready For This Section\r\n\r\nThe DOs and DON'Ts\r\n\r\nUser Flows in Figma — Onboarding\r\n\r\nUser Flows in Figma — Search\r\n\r\n4. Sitemaps\r\n\r\nIntroduction To Sitemaps\r\n\r\nCreating A Basic Sitemap\r\n\r\nReusable Sitemap Assets\r\n\r\nFigma Check In — Basic Components and Variants\r\n\r\nSitemaps in Figma — The Top Layer\r\n\r\nSitemaps in Figma — Digging Deeper\r\n\r\nTips for Creating Great Sitemaps\r\n\r\n\r\n\r\n02 EXPLORE AND ITERATE – Wireframes, Prototyping and Feedback\r\n\r\n1. Wireframes\r\n\r\nWhat Is A Wireframe?\r\n\r\nHow To Create A Wireframe\r\n\r\nFigma Check In — Basic Button Component]\r\n\r\nFigma Check In — Variants\r\n\r\nHow to Use Our Wireframe Components\r\n\r\nWireframes — Home\r\n\r\nWireframes — Cart\r\n\r\nWireframes — Profile\r\n\r\n2. Prototyping\r\n\r\nFigma Check In — Prototyping in Figma\r\n\r\nPrototyping in Figma — Flows and Starting Points\r\n\r\nPrototyping in Figma — Connections\r\n\r\nPrototyping in Figma — Interactions\r\n\r\nPrototyping in Figma — Animations\r\n\r\nPrototyping in Figma — Prototype Settings\r\n\r\nPrototyping in Figma — Prototype Presentation\r\n\r\nProject — Navigation\r\n\r\nProject — Removing an Item from Your Wishlist\r\n\r\nProject — Finding a Product\r\n\r\n3. Getting feedback\r\n\r\nWhy Is Feedback Important?\r\n\r\nConstructive Feedback\r\n\r\n\r\n\r\n03 VISUAL DESIGN – Design Theory + Accessibility\r\n\r\n1. Spacing and Grids\r\n\r\nWhat Is A Grid?\r\n\r\nGrid Basics\r\n\r\nFigma Check In — Fixed and Fluid Grids\r\n\r\nFigma Check In — Breakpoints\r\n\r\nFigma Check In — Grid Style\r\n\r\nProject — Mobile Layout Grid\r\n\r\nProject — Desktop Layout Grids\r\n\r\nSimple Rules to Follow\r\n\r\n2. Typography\r\n\r\nSerifs\r\n\r\nSans Serifs\r\n\r\nDisplay & Mono\r\n\r\nPicking Typefaces\r\n\r\nFigma Check In — Text Properties\r\n\r\nExercise — Elevating a Brand\r\n\r\nExercise — Typeface Scenarios\r\n\r\nExercise — Google Fonts\r\n\r\nProject — Typeface Exploration\r\n\r\nProject — Pairing Font Families\r\n\r\nProject — Headings, Body and Labels\r\n\r\nProject — Typeface System\r\n\r\nFigma Check In — Text Styles\r\n\r\n3. Color\r\n\r\nColor Schemes\r\n\r\nImportant Questions To Ask\r\n\r\nCreating Color Palettes\r\n\r\nFigma Check In — Paints\r\n\r\nExercise — Expanding Upon a Strict Color Palette\r\n\r\nExercise — Creating a Color Palette\r\n\r\nFigma Check In — Color Styles\r\n\r\nExercise — Using Color Styles\r\n\r\nProject — Primary and Neutrals\r\n\r\nProject — Accents\r\n\r\n4. Imagery and Iconography\r\n\r\nVisual Assets Introduction\r\n\r\nFigma Check In — Image Plugins\r\n\r\nFigma Check In — Image Styles\r\n\r\nFigma Check In — Masks\r\n\r\nExercise — Image Exploration\r\n\r\nExercise — Text and Imagery Working Together\r\n\r\nFigma Check In — Illustration Plugins\r\n\r\nExercise — Adding illustrations to your designs\r\n\r\nFigma Check In — Icon Plugins\r\n\r\nFigma Check In — Pen Tool\r\n\r\nExercise — Custom Icons with the Pen Tool\r\n\r\n5. Forms + UI Elements\r\n\r\nWhat Are Forms + UI Elements?\r\n\r\nBest Practices — Forms\r\n\r\nBest Practices — Basic and Advanced Inputs\r\n\r\nBest Practices — Inputs\r\n\r\nBest Practices — Buttons\r\n\r\nFigma Check In — Component Properties\r\n\r\nProperties vs. Variants\r\n\r\nFigma Check In — Button Component Properties\r\n\r\nFigma Check In — Button Variants\r\n\r\nFigma Check In — Combining Components\r\n\r\nFigma Check In — Form Component Possibilities\r\n\r\nProject — Registration Flow\r\n\r\n6. Accessibility\r\n\r\nWhat Is Accessibility?\r\n\r\nAssistive Technologies\r\n\r\nVisual Patterns For Accessibility\r\n\r\nTools To Make Your Design Accessible\r\n\r\n\r\n\r\n04 DESIGN EXPLORATION – Application Design + Design Systems\r\n\r\n1. Design Patterns\r\n\r\nWhat Are Design Patterns?\r\n\r\nWhy Are Design Patterns Valuable?\r\n\r\nHow To Apply Design Patterns\r\n\r\nAnalyzing Design Patterns\r\n\r\nDissecting And Choosing Design Patterns\r\n\r\n2. Mobile Design\r\n\r\nMobile Design Best Practices\r\n\r\n3. Visual Style and Exploration\r\n\r\nDesign Fidelity\r\n\r\nVisual Exploration — Navigation\r\n\r\nVisual Exploration — Buttons\r\n\r\nFigma Check In — Effect Styles\r\n\r\nVisual Exploration — Product Cards\r\n\r\nVisual Exploration — Text Cards\r\n\r\nScreen Design — Home\r\n\r\nScreen Design — Product Page\r\n\r\n4. Motion and Microinteractions\r\n\r\nThe Importance Of Motion\r\n\r\nWhy Microinteractions Are Important?\r\n\r\nWhat Is A Microinteraction?\r\n\r\nFigma Check In — Intro to Smart Animate\r\n\r\nFigma Check In — Smart Animate Properties\r\n\r\nExercise — Parallax\r\n\r\nExercise — New Message\r\n\r\nExercise — Overlays\r\n\r\nFigma Check In — Interactive Components\r\n\r\nExercise — Interactive Buttons\r\n\r\nProject — Parallax Welcome Screen\r\n\r\nProject — Drag Onboarding\r\n\r\nProject — Cart Overlay\r\n\r\nProject — Button Microinteraction\r\n\r\n\r\n\r\n05 PUTTING IT ALL TOGETHER – Using our Design System and Hi-Fi prototyping with Figma\r\n\r\n1. Design Systems\r\n\r\nFoundational Styles and Components vs. Product Specific Components\r\n\r\nBuilding Fidelity and Organizing Potential Components and Styles\r\n\r\nFoundational Styles and Components\r\n\r\nComponents — Buttons\r\n\r\nComponents — Cards\r\n\r\nComponents — Headers\r\n\r\nComponents — Inputs\r\n\r\nComponents — List Items\r\n\r\nComponents — Navigation\r\n\r\nComponents — Misc. Elements\r\n\r\n2. Execution\r\n\r\nWorking Towards Our Final Designs\r\n\r\nExecution — Introduction Screen\r\n\r\nExecution — Onboarding Screens\r\n\r\nExecution — Registration Screens\r\n\r\nExecution — Home Screen\r\n\r\nExecution — Wishlist Screens\r\n\r\nExecution — Profile Screen\r\n\r\nExecution — Cart and Checkout\r\n\r\nPrototypes — Registration\r\n\r\nPrototypes — Adding to Cart\r\n\r\nPrototypes — Checkout\r\n\r\nPrototypes — Lottie Files Plugin\r\n\r\nPrototypes — Search and Filters\r\n\r\n\r\n\r\n06 FROM FIGMA TO WEBSITE (take a Figma design and convert it to a live website using HTML and CSS)\r\n\r\n\r\n\r\n07 HTML + HTML5\r\n\r\n\r\n\r\n08 CSS + CSS3 - CSS Basics, CSS Grid, Flexbox, CSS Animations\r\n\r\n\r\n\r\n09 PUTTING YOUR WEBSITE ONLINE\r\n\r\n\r\n\r\n\r\n\r\nThis brand new course will take you from the very basics where we talk about principles and fundamentals of graphic design, all the way to creating beautiful products, learning about UX/UI and interactions, and creating a full design process for you to use with all of your future projects and clients. We pretty much cover it all so that the next time you are in charge of designing a product you have the step by step outline and guide to work as a professional designer.\r\n\r\n\r\n\r\nWe are going to teach you the skills that will allow you to charge a lot of money for your time. Not to compete for a few dollars an hour on some random freelancing websites. The goal is to give you the skills of a top designer, and along the way, we are going to design an actual product for a company that you will be able to add to your portfolio.\r\n\r\n\r\n\r\nThis course is not about making you just watch along without understanding the principles so that when you are done with the course you don’t know what to do other than watch another tutorial. No! This course will push you and challenge you to go from an absolute beginner to someone that is a top Designer that can get hired! Design is a valuable skill that doesn’t get outdated easily like most technical skills. Trends change, but the skills and fundamentals you learn in this course will take you many years into the future.\r\n\r\n\r\n\r\n\r\n\r\nThis course is for you if:\r\n- You are a complete beginner looking to become a designer and freelance\r\n\r\n- You are a designer who is looking to charge more for your work\r\n\r\n- You are a developer who is looking to improve their design skills\r\n\r\n\r\n\r\nTaught By:\r\n\r\nAndrei is the instructor of the highest rated Development courses on Udemy as well as one of the fastest growing. His graduates have moved on to work for some of the biggest tech companies around the world like Apple, Google, Tesla, Amazon, JP Morgan, IBM, UNIQLO etc... He has been working as a senior software developer in Silicon Valley and Toronto for many years, and is now taking all that he has learned, to teach programming skills and to help you discover the amazing career opportunities that being a developer allows in life.\r\n\r\nHaving been a self taught programmer, he understands that there is an overwhelming number of online courses, tutorials and books that are overly verbose and inadequate at teaching proper skills. Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp. Programming skills should be affordable and open to all. An education material should teach real life skills that are current and they should not waste a student's valuable time. Having learned important lessons from working for Fortune 500 companies, tech startups, to even founding his own business, he is now dedicating 100% of his time to teaching others valuable software development skills in order to take control of their life and work in an exciting industry with infinite possibilities.\r\n\r\nAndrei promises you that there are no other courses out there as comprehensive and as well explained. He believes that in order to learn anything of value, you need to start with the foundation and develop the roots of the tree. Only from there will you be able to learn concepts and specific skills(leaves) that connect to the foundation. Learning becomes exponential when structured in this way.\r\n\r\nTaking his experience in educational psychology and coding, Andrei's courses will take you on an understanding of complex subjects that you never thought would be possible.\r\n\r\n--------\r\n\r\nDaniel is a design leader in tech with extensive experience in helping startups build and iterate on their products. Daniel is passionate about teaching and empowering designers and working with other disciplines to build purposeful products that meet both user and business goals.\r\n\r\nHis approach to design is always thoughtful and iterative. Daniel often finds himself working collaboratively with his team whether that is sketching concepts and flows or leading design strategy with team leads and external stakeholders.\r\n\r\nDaniel is a multi faceted designer who’s expertise expands across multiple design disciplines. This includes User Experience and Visual Design, User Research, Product Strategy, Lean and Agile Design Methodologies and much more. HIs work has helped to shape different solutions for a variety of industries such as housing, blockchain and health.\r\n\r\nWhen he is not building products, Daniel has spoke and mentored at different meetups and events. He aims to give back to the design community that he has learnt and continues to learn so much from. Daniel aims to always help, teach and support other designers in their careers.\r\n\r\n\r\n\r\nSee you inside the courses!\r\n\r\nWho this course is for:\r\nAnyone who wants to start a Web or Mobile Design business on the side as a freelancer, or work as a designer at a company\r\nWeb Developers and Mobile Developers wanting to add another valuable skill to their tool belt\r\nAnyone who wants to get hired as a Web Designer, Mobile Designer, UI/UX Designer\r\nAnyone who wants to learn about the latest CSS3 features like Flexbox, CSS Grid and CSS Variables as well as HTML5",
        "time": 181
    },
    {
        "id": "6357d69b6e835846e9ad4cfe",
        "img_url": "https://contentstatic.techgig.com/photo/88317143/how-and-why-to-become-a-certified-python-programmer-in-2022.jpg?116970",
        "title": "Python Developer",
        "info": "Welcome to the 100 Days of Code - The Complete Python Pro Bootcamp, the only course you need to learn to code with Python. With over 500,000 5 STAR reviews and a 4.8 average, my courses are some of the HIGHEST RATED courses in the history of Udemy!  \r\n\r\n100 days, 1 hour per day, learn to build 1 project per day, this is how you master Python.\r\n\r\nAt 60+ hours, this Python course is without a doubt the most comprehensive Python course available anywhere online. Even if you have zero programming experience, this course will take you from beginner to professional. Here's why:\r\n\r\nThe course is taught by the lead instructor at the App Brewery, London's best in-person programming Bootcamp.\r\n\r\nThe course has been updated to be 2022 ready and you'll be learning the latest tools and technologies used at large companies such as Apple, Google and Netflix.\r\n\r\nThis course doesn't cut any corners, there are beautiful animated explanation videos and tens of real-world projects which you will get to build. e.g. Tinder auto swiper, Snake game, Blog Website, LinkedIn Auto Submit Job Application\r\n\r\nThe curriculum was developed over a period of 2 years, with comprehensive student testing and feedback.\r\n\r\nWe've taught over 600,000 students how to code and many have gone on to change their lives by becoming professional developers or starting their own tech startup.\r\n\r\nYou'll save yourself over $12,000 by enrolling, and still get access to the same teaching materials and learn from the same instructor and curriculum as our in-person programming Bootcamp.\r\n\r\nThe course is constantly updated with new content, with new projects and modules determined by students - that's you!\r\n\r\n\r\n\r\nWe'll take you step-by-step through engaging video tutorials and teach you everything you need to know to succeed as a Python developer.\r\n\r\nThe course includes over 60 hours of HD video tutorials and builds your programming knowledge while making real-world Python projects.\r\n\r\n\r\n\r\nThroughout this comprehensive course, we cover a massive amount of tools and technologies, including:\r\n\r\nPython 3 - the latest version of Python\r\n\r\nPyCharm, Jupyter Notebook, Google Colab\r\n\r\nPython Scripting and Automation\r\n\r\nPython Game Development\r\n\r\nWeb Scraping\r\n\r\nBeautiful Soup\r\n\r\nSelenium Web Driver\r\n\r\nRequest\r\n\r\nWTForms\r\n\r\nData Science\r\n\r\nPandas\r\n\r\nNumPy\r\n\r\nMatplotlib\r\n\r\nPlotly\r\n\r\nScikit learn\r\n\r\nSeaborn\r\n\r\nTurtle\r\n\r\nPython GUI Desktop App Development\r\n\r\nTkinter\r\n\r\nFront-End Web Development\r\n\r\nHTML 5\r\n\r\nCSS 3\r\n\r\nBootstrap 4\r\n\r\nBash Command Line\r\n\r\nGit, GitHub and Version Control\r\n\r\nBackend Web Development\r\n\r\nFlask\r\n\r\nREST\r\n\r\nAPIs\r\n\r\nDatabases\r\n\r\nSQL\r\n\r\nSQLite\r\n\r\nPostgreSQL\r\n\r\nAuthentication\r\n\r\nWeb Design\r\n\r\nDeployment with GitHub Pages, Heroku and GUnicorn\r\n\r\nand much much more!\r\n\r\nBy the end of this course, you will be fluently programming in Python and you'll be so good at Python that you can get a job or use the language professionally.\r\n\r\nYou'll also build a portfolio of 100 projects that you can show off to any potential employer. Including:\r\n\r\nBlackjack\r\n\r\nSnake Game\r\n\r\nPong Game\r\n\r\nAuto Swipe on Tinder\r\n\r\nAuto Job Applications on LinkedIn\r\n\r\nAutomate Birthday Emails/SMS\r\n\r\nFully Fledged Blog Website\r\n\r\nBuild Your Own Public API\r\n\r\nData Science with Google Trends\r\n\r\nAnalysing Lego Datasets\r\n\r\nGoogle App Store Analysis\r\n\r\nand much much more!\r\n\r\nSign up today, and look forward to:\r\n\r\nVideo Lectures\r\n\r\nCode Challenges and Exercises\r\n\r\nFully Fledged Projects\r\n\r\nQuizzes\r\n\r\nProgramming Resources and Cheatsheets\r\n\r\nDownloads\r\n\r\nOur best selling 12 Rules to Learn to Code eBook\r\n\r\n$12,000+ Python Pro Bootcamp course materials and curriculum\r\n\r\n\r\n\r\nDon't just take my word for it, check out what existing students have to say about my courses:\r\n\r\n\"Angela is just incredible, awesome and just fantastic in this course. I've never had such an instructor; detailed in every aspect of the course, gives precise explanations, gives you the anxiety to learn etc. She's got that ability to make fun while explaining things for better understanding. I really love this course.\" - Ekeu MonkamUlrich\r\n\r\n\"Angela is very thorough without ever being boring. I've taken MANY online courses in my life including my Bachelors and Masters degrees. She is by far the best instructor I've ever had. This course is packed with thousands of dollars worth of great instruction, and paced well enough for anyone to pick coding up and run with it- Thank you!\" - J Carlucci\r\n\r\n\"Love the way Angela explains things. Easy to follow and full of logic. I can say she must spend a lot of energy creating this great course. Thank you and I recommend it to all who's interested in coding!\" - Yiqing Zheng\r\n\r\n\"So far (on my third day) this course has taught me more than I was able to learn in multiple other programming courses. This course is clearly outlined and builds upon itself gradually in an easy to understand way.\" - Normal Ramsey\r\n\r\n\"It's a different approach to teaching Web Development. I like that you are given everything possible to succeed from the onset.\" - Ronick Thomas\r\n\r\nThe tutor is simply AMAZING, by far the best tutor I have ever had. I would give her 10 stars out of 5. She is not just punching the code and talking to herself, but she is actually explaining things. She keeps on giving really useful hints and she will give you a great load of other references. I always knew what I was doing and why I was doing it. All the extra challenges have just made me remember and understand things better. - Peter Dlugos\r\n\r\n\r\n\r\n\r\n\r\nREMEMBER… I'm so confident that you'll love this course that we're offering a FULL money-back guarantee for 30 days! So it's a complete no-brainer, sign up today with ZERO risk and EVERYTHING to gain.\r\n\r\nSo what are you waiting for? Click the buy now button and join the world's highest-rated development course.\r\n\r\nWho this course is for:\r\nIf you want to learn to code from scratch through building fun and useful projects, then take this course.\r\nIf you want to start your own startup by building your own websites and web apps.\r\nIf you are a complete beginner then this course will be everything you need to become a Python professional\r\nIf you are a seasoned programmer wanting to switch to Python then this is the quickest way. Learn through coding projects.\r\nIf you are an intermediate Python programmer then you know 100 days of code challenges will help you level up.",
        "time": 293
    },
    {
        "id": "6357d69baed2995961a56926",
        "img_url": "https://cdnb.artstation.com/p/assets/images/images/055/296/831/large/mohammx-safa-timebomb-depo.jpg?1666621373",
        "title": "3D Concept Art",
        "info": "Learn the ability of incorporating renderings in your workflow and take your creation process to the next level. This 8+ hour class will take you through all the steps from 100% start to finish on how become an efficient artist and create powerful conceptual artworks in no time.\r\n\r\nYou will learn the Basics of 3D modelling in an intuitive learning approach which not only keeps you motivated, but also gives you an actual in depth insight on how professionals work. Working with 3D-concepts is probably the most direct and the fastest way to take your portfolio to the next level. If you're genuinely interested to land your first job in the industry and gain the core knowledge of creating conceptual artworks then this is the perfect class for you!\r\n\r\nWho this course is for:\r\nBeginner Digital Artists curious about Concept Art\r\nBlender Beginners\r\nStudents who want to expand their Tool-set",
        "time": 336
    }
]